#!/usr/bin/env python3
# -*- coding: utf-8 -*-

# Есть словарь координат городов

sites = {
    'Moscow': (550, 370),
    'London': (510, 510),
    'Paris': (480, 480),
}

# Составим словарь словарей расстояний между ними
# расстояние на координатной сетке - ((x1 - x2) ** 2 + (y1 - y2) ** 2) ** 0.5

distances = {
    'Moscow':{'London':((550-510)**2 +(370-587)**2)**0.5,'Paris':((550-480)**2 +(370-480)**2)**0.5,},
    'London':{'Moscow':((510-550)**2 +(510-370)**2)**0.5,'Paris':((510-480)**2 +(510-480)**2)**0.5,},
    'Paris':{'Moscow':((480-550)**2 +(480-370)**2)**0.5,'London':((480-510)**2 +(480-510)**2)**0.5,},
}

# TODO здесь заполнение словаря

print(distances)




